# Suffix Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DimensionSegment..::..Suffix Property
DimensionSegment Class See Also
---
The text shown after the segment's value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string Suffix { get; set; }
```

Visual Basic
---
```text
Public Property Suffix As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ Suffix {
	String^ get ();
	void set (String^ value);
}
```

# See Also
DimensionSegment Class
Autodesk.Revit.DB Namespace